[
 {
    "title": "Eggplant Chilli Noodles",
    "image": "/DN-Eggplant.jpg",
    "subtext1": "Step 1: In a pot, heat water to cook the noodles. Once it boils, add in the nodes and cook until half-cooked and chewy. Remove from the water and set.",
    "subtext2": "Step 2: Heat a large pan over medium high. Add in the sesame oil. Once hot, add in the onion. Sauté over medium high heat for 2 minutes. Add in the garlic.",
    "subtext3": "Step 3: Add eggplant into the pan with the bell peppers. Leave eggplant to cook over medium high heat until tender, around 6 minutes.",
    "prep1": "Calories: 310",
    "prep2": "Prep Time: 10 minutes",
    "prep3": "Cook Time: 25 minutes",
    "prep4": "Total Time: 35 minutes",
    "Ingred1": "120g uncooked noodles",
    "Ingred2": "2 small eggplants",
    "Ingred3": "1 small onion",
    "Ingred4": "4 garlic cloves",
    "ingred5": "1 bell pepper",
    "Ingred6": "3 tbsp soy sauce"
  },
    
  {
    "title": "Mushroom & Rice Cream Soup",
    "image": "/SR-Mushroom.jpg",
    "subtext1":"Step 1: Add some butter to a large pot and place over medium-high heat. Add the mushrooms and cook, stirring, occasionally, until they are tender and browned and have absorbed most of the liquid they've let off, about 5 minutes. Add Worcestershire and cook until it is absorbed by the mushrooms, 2 minutes. Remove from heat and transfer the mushrooms to a plate and set aside.",
    "subtext2":"Step 2: Add the onion, celery, and carrot and cook, stirring occasionally for about 5 minutes. Add salt and pepper, stirring the mixture well to coat the veggies with the spices.",
    "subtext3":"Step 3: Reduce the heat to medium and pour in the chicken broth, stirring the mixture. Add the uncooked rice and return the mushrooms to the pot. Increase the heat as needed to bring the soup to a boil, stirring occasionally. Cover, turn the heat down to low and simmer 30 minutes or until the rice is tender.",
    "subtext4":"Step 4: Add the whole milk. Stir and remove from the heat. Taste and season with salt and pepper, if needed. Garnish with thyme leaves (optional) and serve.",
    "prep1":"Calories: 540",
    "prep2":"Prep Time: 15 minutes",
    "prep3":"Cook Time: 42 minutes",
    "prep4":"Total Time: 57 minutes",
    "ingred1":"8 oz mushrooms",
    "ingred2":"1 tsp Worcestershire sauce",
    "ingred3":"5 cups chicken broth",
    "ingred4":"1 cup whole milk",
    "ingred5":"1 cup uncooked white rice",
    "ingred6":"2 cups of celery, carrots, and onions"
  },

 {
    "title": "Tomato & Rice Soup",
    "image": "/tomato_rice_soup.jpeg",
    "subtext1":"Step 1: Heat the olive oil in a large soup pot. Add the onion and sauté for 7-8 minutes, until translucent",
    "subtext2":"Step 2: Reduce the heat to low, add the crushed tomatoes, water and salt. Turn heat to medium-high and bring to a boil",
    "subtext3":"Step 3: Add the rice and stir well. Reduce the heat to low again, cover and let simmer for about 10-15 minutes or until the rice starts to soften (increase the time to 30-35 minutes if using brown rice).",
    "subtext4":"Step 4: Take the pot off the heat and keep it covered for another 10 minutes or until the rice has cooked completely. Add basil on top and serve.",
    "prep1":"Calories: 310",
    "prep2":"Prep Time: 5 minutes",
    "prep3":"Cook Time: 25 minutes",
    "prep4":"Total Time: 30 minutes",
    "ingred1":"2 tbsp olive oil",
    "ingred2":"1 large onion",
    "ingred3":"1 can crushed tomatoes",
    "ingred4":"½ cup basmati rice",
    "ingred5":"3 cups of water",
    "ingred6":"¼ cup fresh basil"
  },
    
 {
    "title": "Spicy Carrot Fried Rice",
    "image": "/Spicy-Carrot-Fried-Rice.png",
    "subtext1":"Step 1: In a large skillet heat the oil. Add the onion and carrots and stir-fry over high heat until softened and beginning to brown, about 5 minutes.",
    "subtext2":"Step 2: Add the garlic and stir-fry until fragrant, about 1 minute. Stir in the Sriracha and cook until the carrots are coated, 1 minute. ",
    "subtext3":"Step 3: Add the rice, and cook, stirring constantly, until heated through and beginning to brown, about 4 minutes.",
    "subtext4":"Step 4: Push the fried rice to the side of the pan to create a well. Pour the eggs into the well and cook, stirring gently, until nearly set. Toss the fried rice with the eggs and cook for 5 minute. Remove the pan from the heat, stir in soy sauce. Add lime juice and cilantro (optional) and serve.",
    "prep1":"Calories: 258",
    "prep2":"Prep Time: 10 minutes",
    "prep3":"Cook Time: 15 minutes",
    "prep4":"Total Time: 25 minutes",
    "ingred1":"1 small yellow onion",
    "ingred2":"2 cups carrots",
    "ingred3":"4 cups of long-grain white rice",
    "ingred4":"4 large eggs",
    "ingred5":"2 garlic cloves",
    "ingred6":"2 tablespoons of soy sauce and sriracha"
  },
    
  {
    "title": "Onion Parmesan Pasta",
    "image": "/DN-Onion.jpg",
    "subtext1":"Step 1: Heat oil in a large heavy pot over medium. Add onions and garlic and cook, stirring occasionally, until very tender and deeply golden brown, about 30 minutes.",
    "subtext2":"Step 2: Add red pepper flakes (if using) and 1 1/2 tsp. salt. Remove pot from heat.",
    "subtext3":"Step 3: Meanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Reserve 1 1/2 cups pasta cooking liquid.",
    "subtext4":"Step 4: Add pasta and 1 cup pasta cooking liquid to onion mixture and stir to combine. Add a small handful of cheese and stir until melted. Repeat with remaining cheese, adding more pasta cooking liquid as needed to create a glossy sauce that coats the pasta. Divide pasta among bowls. Top with Parmesan, and a few cranks of pepper. Serve and enjoy.",
    "prep1":"Calories: 390",
    "prep2":"Prep Time: 20 minutes",
    "prep3":"Cook Time: 35 minutes",
    "prep4":"Total Time: 55 minutes",
    "ingred1":"2 tbsp virgin olive oil",
    "ingred2":"12 oz linguine",
    "ingred3":"3 large onions",
    "ingred4":"2 garlic cloves",
    "ingred5":"¼ tsp red pepper flakes",
    "ingred6":"1 cup Parmesan"
  },
    
  {
    "title": "Stuffed Pepper With Rice",
    "image": "/DR-pepper.jpeg",
    "subtext1":"Step 1: Preheat oven to 400°. Beat together eggs, 2 teaspoons of water, and a pinch of  salt. Preheat a large (12-inch) nonstick T-fal skillet over medium, about 2 minutes, until the Thermo-Spot turns solid. Coat with 2 tsp oil.",
    "subtext2":"Step 2: Add egg mixture and cook, pushing eggs toward center of pan to form large, soft curds, about 30 seconds. Scrape eggs onto a plate.",
    "subtext3":"Step 3: Return skillet to medium heat and add the remaining 3 tbsp of the oil, add rice, chicken, and soy sauce; cook stirring occasionally until heated through, about 5 minutes. Season with salt and pepper. Scrape rice mixture into a bowl and wipe skillet out with paper towels.",
    "subtext4":"Step 4: Arrange peppers in skillet. Spoon fried rice mixture into each pepper and cover skillet with foil. Bake until peppers are tender, about 45 minutes. Drizzle stuffed peppers with sriracha and garnish (optional) and serve.",
    "prep1":"Calories: 350",
    "prep2":"Prep Time: 15 minutes",
    "prep3":"Cook Time: 60 minutes",
    "prep4":"Total Time: 75 minutes",
    "ingred1":"3 tbsp olive oil",
    "ingred2":"4 bell peppers",
    "ingred3":"2 cups parboiled white rice",
    "ingred4":"2 cups rotisserie chicken",
    "ingred5":"2 large eggs",
    "ingred6":"3 tbsp soy sauce"
  }
]
